; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj2 obj4 obj11 - airport
	obj1 obj5 - city
	obj3 obj10 obj12 obj13 - package
	obj6 obj15 obj16 - location
	obj7 obj8 obj14 - truck
	obj9 - airplane
)

(:init
	(at obj14 obj6)
	(at obj10 obj6)
	(in-city obj15 obj1)
	(at obj9 obj4)
	(at obj12 obj2)
	(at obj13 obj11)
	(in-city obj2 obj1)
	(in-city obj6 obj1)
	(at obj7 obj2)
	(in-city obj4 obj5)
	(in-city obj16 obj1)
	(at obj3 obj0)
	(in-city obj0 obj1)
	(at obj8 obj4)
	(in-city obj11 obj5)
)

(:goal (and
	(at obj10 obj0)
	(at obj13 obj4)
	(at obj12 obj0)
))
)

; plan
1. (fly obj9 obj4 obj0)
   deleted: (at obj9 obj4)
   added: (at obj9 obj0)
   goals met: 0 of 3
2. (drive obj8 obj4 obj11)
   deleted: (at obj8 obj4)
   added: (at obj8 obj11)
   goals met: 0 of 3
3. (load obj8 obj13 obj11)
   deleted: (at obj13 obj11)
   added: (in obj13 obj8)
   goals met: 0 of 3
4. (drive obj8 obj11 obj4)
   deleted: (at obj8 obj11)
   added: (at obj8 obj4)
   goals met: 0 of 3
5. (unload obj8 obj13 obj4)
   deleted: (in obj13 obj8)
   added: (at obj13 obj4)
   goals met: 1 of 3
6. (load obj7 obj12 obj2)
   deleted: (at obj12 obj2)
   added: (in obj12 obj7)
   goals met: 1 of 3
7. (drive obj7 obj2 obj0)
   deleted: (at obj7 obj2)
   added: (at obj7 obj0)
   goals met: 1 of 3
8. (unload obj7 obj12 obj0)
   deleted: (in obj12 obj7)
   added: (at obj12 obj0)
   goals met: 2 of 3
9. (load obj14 obj10 obj6)
   deleted: (at obj10 obj6)
   added: (in obj10 obj14)
   goals met: 2 of 3
10. (drive obj14 obj6 obj0)
   deleted: (at obj14 obj6)
   added: (at obj14 obj0)
   goals met: 2 of 3
11. (unload obj14 obj10 obj0)
   deleted: (in obj10 obj14)
   added: (at obj10 obj0)
   goals met: 3 of 3
